
# coding: utf-8

# In[1]:

url = 'https://raw.githubusercontent.com/bog5d/Feng-chao/master/profit.csv'

import pandas as pd 
import numpy as np
#prof = pd.read_excel('/Users/apple/Downloads/销售毛利明细表20181016.xlsx',sep='\t',header=2).fillna('/')
prof = pd.read_csv(url,header=2).fillna('/')
prof['单据类型'] = prof['单据类型'].replace(r'往来销售',np.nan,regex=True)

prof= prof.fillna(method='pad')
prof = prof.loc[~(prof['单据日期']=='/')]
#pd.to_datetime('单据日期')
prof['单据日期']= pd.to_datetime(prof['单据日期'])
prof = prof.set_index('单据日期')
prof = prof[['单据类型',  '客户名称', '数量', '销售价', '成本价', '销售收入', '销售成本',
       '销售毛利', '销售毛利率']].rename(columns={'单据类型':'型号'})
#prof.loc[(prof['客户名称'].isin(old_dealer))]

x=('零散销售|万进腾商贸有限公司|大坪售后|创新渠道户|商渠及其他客户|万家乐总部茶园分库|万盛区专卖店-傅建春13370751538|万盛区专卖店-许中良18223025559|丰都县专卖店-苏正勇17320389351|丰都县龙城华府专卖店-舒正勇17320389351|丰都高仕林-18581407666|九龙坡区曾家镇专卖店-唐勇13983220787|九龙坡区西彭镇专卖店-徐老板13883422468|余杰15182832850|北碚专卖店-杨琴13983866670|南岸区茶园-刘成碧13028393392|南川专卖店-王俊利13908380118|南川区水江镇专卖店-郑志刚15023505238|南川县城专卖店-杨淳之13609463539|合川专卖店-李灵健13399879976|大足-陈莉13983273966|大足区龙水镇专卖店-赵春13896155668|大足双桥-王波13509427312|大足零售|大足龙水-伍敏15823806199|大足龙腾建材市场专卖店-刘平18290408883|彭水县-刘小文15023985889|彭水县专卖店-曾林周13594936789|彭美容13637964310|武隆区专卖店-何梅17783326220|永川区专卖店-陶波18623611600|江津区小官山专卖店-聂小敏13648366797|江津区白沙镇专卖店-辜世兵18223187788|涪陵专卖店-欧华13896660130|涪陵区白涛镇专卖店-高勇13983330380|涪陵荣事达厨卫-梁永刚13638228227|涪陵马鞍镇专柜-刘成江13996771478|渝中区新华路批发商-郑平13320203551|渝北区回兴街道专卖店-张皓月15523325256|潼南-刘晓飞13983654568|潼南专卖店-贺健全15923193789|潼南批发-李秀刚13350328937|璧山区专卖店-丁应发18996039366|界石曙光工业园-赵相虎13808301493|白市驿专卖店-李政15213145597|秀山县专卖店-王俊凯18896183679|綦江专卖店-贺洪伟13594606456|綦江九龙大道帅康厨卫-胡小松15823568881|綦江兄弟建材-蔡姐15310159262|綦江龙角路名气厨卫-冯丽15223208278|荣昌区-王梅13996069608|荣昌零售|酉阳县专卖店-黄忠平13996953429|铜梁柳朋-15923286764|铜梁美达-杨光明|长寿-陈波13983364973|长寿区-黄友明13368313748|长寿帅邦-黄小波13102369338|长寿晏家镇散货-李霞15123123247|长寿桃花大道-余小群15123037348|长寿美大集成灶-李友林15123610275|长生桥专卖店-张期文13696471299|鱼洞中干道专卖店-杜贞兰15723344238|黔江-白江13308272849|黔江区专卖店-吴时权13996970436|黔江贰金商贸-王国军18680996278')

liutong = prof.loc[~(prof['客户名称'].str.contains(x))]


# 切割 为所属业务和客户名称

liutong = liutong.copy()

liutong['所属业务'],liutong['客户名称']=liutong['客户名称'].str.split('-',1).str

# 找出流通型号

liutong = liutong.loc[liutong['型号'].str.contains('GD1|GD2|GHF|12G2|12G3')]


liutong = liutong.loc[~liutong['客户名称'].isna()]


# 建立映射
# 参考代码 food = {'<=100':'1','100-500':'2','500-1000':'3','1000-3000':'4','>3000':'5'}
# df['工作日消费指数'] = df['工作日消费金额'].map(food)
# 把每个型号的名称和价格，做成字典，按照key——value对应起来。
price = {'万家乐电热水器D60-GHF(B)':660,
         '万家乐电热水器(空壳机)D60-GHF(D)':310,
         '万家乐电热水器D80-GHF(D)':760,
         '万家乐电热水器D60-GHF(D)':660,
         '万家乐电热水器D60-GD1*60L储水式电热水器':550,
         '万家乐燃气热水器JSQ24-12G3*12T(珍珠白)':1100,
         '万家乐燃气热水器JSQ24-12G2*12T(高光白数码恒温)':900,
         '万家乐燃气热水器(空壳机)JSQ24-12G3*12T(珍珠白)':310,
         '万家乐燃气热水器(空壳机)JSQ24-12G2*12T(高光白)':310,
         '万家乐电热水器D60-GD2*60L储水式电热水器':700,
         '万家乐电热水器D100-GD1*DH100GD1B':750,
         '万家乐电热水器D80-GD1*DH80GD1B':650}
# 生成新的列，使用map函数，让最低发价对应型号
liutong['最低发价'] = liutong['型号'].map(price)
liutong['价差'] =liutong['销售价']-liutong['最低发价']

def ti_cheng(x):
    if x < 0:
        return 0
    elif 10>x>=0:
        return 10
    else:
        return 20
liutong['单台提成'] = liutong['价差'].apply(ti_cheng)
liutong['小计提成'] =(liutong['单台提成']*liutong['数量'])


liutong[['数量','销售价','最低发价','单台提成','小计提成']] = liutong[['数量','销售价','最低发价','单台提成','小计提成']].astype('float')

Sales_Commission_Details = liutong['2018'][['所属业务','型号','数量','销售价','最低发价','单台提成','小计提成']]

Sales_Commission_Summary = Sales_Commission_Details.groupby('所属业务').sum()[['数量','小计提成']]
print (Sales_Commission_Summary)
print (Sales_Commission_Details)


# In[ ]:



